{
  "title": "Quantum Computing",
  "cells": [
    {
      "type": "text",
      "data": "<div>Remember:</div><div><span class=\"Apple-tab-span\" style=\"white-space:pre\">\t</span>Quantum computers aren't going to exist on your phone. They'll be in specialized data centers accessible via the cloud, similar cloud-based mixed computation model like GPUs and FPGAs for hardware-based acceleration.</div><div><br></div><div><span class=\"Apple-tab-span\" style=\"white-space:pre\">\t</span>Machine learning (matrix operations), carbon capture, nitrogen fixation</div><div><br></div><div><br></div><div>Microsoft's contributions to Quantum Computing:</div><div><span class=\"Apple-tab-span\" style=\"white-space:pre\">\t</span>1) Scalable hardware stack for quantum computing - Q#, local simulator,&nbsp;</div><div><span class=\"Apple-tab-span\" style=\"white-space:pre\">\t</span>2) Topological qubit - qubits are fragile, how to make robust to noise? Store data \"non-locally\" - this just sounds like storing measured quantum state on intermediate steps such that you can restart your computation in case of failures</div><div><br></div><div><br></div><div><br></div><div><br></div><div>Quantum computers will make personalized medicine a reality, parsing out the function of every protein in the human genome and modeling their interactions with all possible complex molecules very quickly. We will see simulation-based climate change solutions come to light, and find new chemistry-driven solutions to carbon capture. We are likely to see huge leaps in material science and engineering that allow us to create better magnets, better superconductors, and much higher energy density batteries. And we are almost certainly going to see more technological advances through biomimetics as we find ourselves achieving more insights into natural processes, such as photosynthesis.</div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div>1) Machine Learning: Much of machine learning is about “pattern recognition.” Algorithms crunch large datasets to find signals in the noise, and the goal is to maximize the number of comparisons you make between data to find the best models to describe that data. With quantum computing, we’ll be able to do this processing orders of magnitude more effectively than with classical computing. Quantum computing will allow you to compare much, much more data in parallel, simultaneously, and all permutations of that data, to discover the best patterns that describe it. This will lead to fundamentally more powerful forms of AI, much more quickly than we expect. Expect quantum computing to cause a positive inflection point (upward) for the speed at which the world develops AI (which, by the way, is why Google is working so hard on it).</div><div><br></div><div>2) Medicine: Quantum computing will also allow us to model complex molecular interactions at an atomic level. This will be particularly important for medical research and drug discovery. Soon we’ll be able to model all 20,000+ proteins encoded in the human genome and start to simulate their interactions with models of existing drugs or new drugs that haven’t been invented yet. Based on the analysis of these drug interactions, we’ll be able to find cures for previously incurable diseases and hopefully accelerate the time to market for new drugs. Using quantum computer simulations will be the way we design and choose our next generations of drugs and cancer cures.</div><div><br></div><div>3) Chemistry (and Climate Change): Worried about the climate crisis? Wondering what we can do about it? Quantum computers may be our newest tool to understand what is going on and to fight it. They will allow us to unlock “simulation-driven” solutions, perhaps design new catalysts that actually capture carbon from the atmosphere and turn it into new and valuable products at low cost and energy use.</div><div><br></div><div>4) Material Science &amp; Engineering: Because we can simulate atomic interactions, we’ll explore and invent entirely new, better materials. We might find better superconductors, better magnets, materials that will allow us to create much higher energy density batteries, and so on. Since 2011, the U.S. federal government has granted over $250 million to the Materials Genome Initiative in an effort to “discover, manufacture, and deploy advanced materials twice as fast, at a fraction of the cost.”</div><div>Biomimetics, Energy Systems, &amp; Photovoltaics: Scientists believe that much of the world is built atop quantum systems. Processes like photosynthesis, for example, are likely dependent on quantum mechanical systems. Thus, as we look to the natural world for inspiration to build better energy systems or stronger materials, we’ll only fully realize their potential when we can model these processes with quantum computers. This will lead to many advances and discoveries across the board.</div><div><br></div><div>1) Google</div><div>2) IBM</div><div>3) Rigetti Computing, a startup out of Silicon Valley</div><div>4) D-Wave Systems</div><div><br></div><div><br></div><div>http://www.quantumplayground.net/#/home</div><div><br></div><div>A Practical Quantum Instruction Set Architecture</div><div>https://arxiv.org/pdf/1608.03355.pdf</div><div><br></div><div><br></div><div>Assuming that the starting state of the computer is a computational basis state is also not necessary; we know that many systems in Nature ‘prefer’ to sit in highly entangled states of many systems; might it be possible to exploit this preference to obtain extra computational power? It might be that having access to certain states allows particular computations to be done much more easily than if we are constrained to start in the computational basis.</div><div><br></div><div><br></div><div>https://www.safaribooksonline.com/library/view/quantum-computing-since/9781107301016/</div><div>https://www.safaribooksonline.com/library/view/quantum-computation-and/9780511994005</div><div><br></div><div>A Practical Quantum Instruction Set Architecture</div><div>https://arxiv.org/pdf/1608.03355.pdf</div><div><br></div><div>Quantum Programming in QCL</div><div>http://tph.tuwien.ac.at/~oemer/doc/quprog.pdf</div><div><br></div><div>Basic concepts in quantum computation</div><div>https://arxiv.org/pdf/quant-ph/0011013.pdf</div><div><br></div><div>Quantum hyperparallel algorithm for matrix multiplication</div><div>https://www.nature.com/articles/srep24910</div><div><br></div><div>Quantum algorithms for matrix multiplication and product verification</div><div>http://www.math.uwaterloo.ca/~anayak/papers/KN.pdf</div><div><br></div><div>Elementary gates for quantum computation</div><div>https://arxiv.org/pdf/quant-ph/9503016.pdf</div><div><br></div><div>Unitary Matrices</div><div>http://www.math.tamu.edu/~dallen/m640_03c/lectures/chapter4.pdf</div><div><br></div><div>Polynomial-Time Algorithms for Prime Factorization and Discrete Logarithms on a Quantum Computer</div><div>https://arxiv.org/pdf/quant-ph/9508027v2.pdf</div><div><br></div><div><br></div><div>A blueprint for demonstrating quantum supremacy with superconducting qubits</div><div>https://arxiv.org/pdf/1709.06678.pdf</div><div><br></div><div>Breaking the 49-Qubit Barrier in the Simulation of Quantum Circuits</div><div>https://arxiv.org/pdf/1710.05867.pdf</div><div><br></div><div>Characterizing Quantum Supremacy in Near-Term Devices</div><div>https://arxiv.org/pdf/1608.00263.pdf</div><div><br></div><div>A fast quantum mechanical algorithm for database search</div><div>https://arxiv.org/pdf/quant-ph/9605043.pdf</div><div><br></div><div>Shor's Quantum Factoring Algorithm</div><div>http://algassert.com/post/1718</div><div><br></div><div>Grover’s Quantum Search Algorithm</div><div>http://twistedoakstudios.com/blog/Post2644_grovers-quantum-search-algorithm</div><div><br></div><div>Why Will Quantum Computers be Slow?</div><div>http://algassert.com/post/1800</div><div><br></div><div><br></div><div>QFT -- uses complex primitive root of unity</div>"
    }
  ]
}