{
  "title": "Untitled Note",
  "cells": [
    {
      "type": "markdown",
      "data": "Dear users of Mystique,\n\nWe've been hard at work in recent weeks on both new features as well as stabilizing updates. We're writing in efforts to inform you of some of these new features, and to provide you with an easy path for upgrading to the latest versions of Mystique's code. Some highlights:\n\n* Sample jobs repo - for your edification, Mystique has created a mystique-sample-jobs repository, which contains example jobs for all of Mystique's current offerings, along with tests, sample deployments, and heavy documentation. This is first iteration - much more to come!\n* HyperLogLog jobs - HLLs are a probabilistic data structure intended to estimate set cardinalities with an extremely minimal space footprint. Mystique has released jobs using this data structure (ProfX, Superman pending), which has allowed us to greatly increase our streaming throughput for jobs involving high cardinalities (views, impressions, clicks).\n* Additional logging - we've introduced some logging (especially around builds and deploys) that will greatly aid both you and us in debugging jobs.\n* * SSL changes to accomodate connections to Walmart Cassandra\n* Listeners are generalized to return a sequence of rows rather than 0 or 1\n* Support for Cassandra collections - Lists, Sets and Maps (both frozen and append-only)\n* Configurable thresholds for kafka lag and heartbeat thresholds\n* Extra Cosmos indices are dropped by default\n* Ability to do backfills directly from blob storage rather than Kafka\n* New job type for read-modify-write workflows (with an optional repartition of data)\n\nFurther - we've been notified by DevOps of two existing issues with our prod deployments; the first is related to the short expiration period of SAS tokens on JARs, and the second related to the prod Nomad update rolling out on the 9th. We'd like to get ahead of both of these while giving you a bunch of new functionality as well. :+1:\n\ntl;dr - new features! let's update!"
    }
  ]
}