{
  "title": "Module 2: Network Devices and Theory",
  "cells": [
    {
      "type": "markdown",
      "data": "**TO REVIEW**\n1) VPN Concentrators\n2) NAS / SAN\n\n## Analog Modems\n\n_Modem - Modulator-Demodulator_\n\nModems had to go out over the Public-Switched Telephone Network (PSTN), which meant converting digital signals to analog ones (PSTN is analog).\n\nModem speeds were measured in _baud rate_ and _bits per seconds_:\n* _Baud_ - number of tone changes per second\n* _BPS_ - numbers of bits...per...second over a line\n\nModems can use multiple channels, each with some fixed baud rate. So a 2400-baud modem over 4 channels == 9600 bps.\n\n## Hubs, Switches, and Routers\n\n**Hubs** send egress traffic from a connected machine to ALL OTHER CONNECTED MACHINES. So your print command packets go to everyone. Bad.\n\n**Switches** route based off MAC addresses, which is a layer 2 address. Initially, switches will flood the network in order to learn which MAC addresses live off which ports on the switch (`Gig 1`, `Gig 2`). As packets flow through the switch, it'll learn and stop flooding, routing directly to intended devices. Switches use ASICs (Application-Specific Integrated Circuits) to make really fast switching decisions.\n\n**Bridges** are the same as switches, but they usually had fewer ports and made their decisions at the software level, causing slowdown over switch ASICs.\n\n**Routers** route based off layer 3 IP addresses. Switches can be connected to routers to handle some IP subnet, and default routes (`0.0.0.0/0`) will handle default requests to the internet to be further routed.\n\n![IMAGE](quiver-image-url/A5C9615C54D2B145967746B8DFF599BB.jpg =1570x872)\n\n## Collision Domains\n\nFor an ethernet bus with devices on a shared segment, only one frame is allowed to be on the segment at any one time. **Carrier Sense Multiple Access / Collision Detection** (CSMA/CD) allows devices on the shared segment to listen for frames on the bus, and to transmit when there are none. This can lead to race conditions - two devices simultaneously acting on the \"all clear\". The retransmit will then allow for a backoff between the two devices - 10ms for device 1 and 20ms for device 2.\n\nAn ethernet hub as described above is one collision domain - no good! But an ethernet switch with (for example) four devices will have four collision domains, which means we don't have to run CSMA/CD!\n\nHaving more collision domains and no CSMA/CD on a switch means we run in **full-duplex** mode, i.e. we can receive and transmit simultaneously. Hubs require half-duplix.\n\n## Broadcast Domains\n\nMuch like that for collision domains, ethernet hubs share a broadcast domain (push traffic to all ports except the sender).\n\nSwitches, however, all share a broadcast domain despite that they don't share collision domains.\n\nRouters can be used to create different broadcast domains, though. Routers work at L3, so this makes sense -- a broadcast MAC address is all `F`s for the hex MAC address.\n\n## CSMA/CD vs CSMA/CA\n\nA hub can send a jam signal to indicate collisions, and retransmit with some random backoff to avoid collisions. Collisions can also be detected as a voltage spike on the coaxial cable serving as the ethernet bus.\n\nCSMA/CA is similar to CSMA/CD, except that due to `hidden node` problems in wireless networks, a node might not be able to detect the signal sent by another node. Then its carrier sense would fail, and it would try to transmit at a bad time and potentially hit a collision.\n\nSo instead wireless networks do `collision avoidance` (CA), which just detects for an acknowledgement of its transmission. If it doesn't get it, probably a collision!\n\n## Wireless Access Points\n\nNow we communicate with wireless access points with protocols like 802.11A, etc. -- more on this later! But the wireless access point is hooked into a switch / router from there.\n\nYou could also communicate via an adhoc network, where two devices commuicate directly.\n\nThese access points are either:\n* `autonomous APs` -- set up and configure each one individually\n* `lightweight APs` -- set up the APs and configure them centrally with a wireless LAN (WLAN) controller, which uses either LWAPP or CAPWAP to communicate with each lightweight AP.\n\n## Firewalls\n\nTypes:\n1) Packet Filters\n    * Permit / Deny based off source / dest (IPs / CIDR blocks)\n    * ![IMAGE](quiver-image-url/ABDC04A46AB0C5D14B72A6151EEF011F.jpg =760x196)\n    * The above has a problem with return traffic from public internet!!\n2) Stateful Firewall\n    * Observes / inspects traffic at the firewall, and can recognize return traffic. This helps the above situation where egress traffic is permitted, but response ingress traffic is denied.\n3) Application Layer Firewall\n    * Understands IP (1), sessions / return traffic (2), and applications. So even if applications use multiple ports (like VoIP), this kind of firewall will recognize that all this return traffic is part of one application and session, and will let it through.\n    \nSome firewalls are hardware-based, and some are software-based. Routers can include firewall rule sets!\n\n## Firewall with a DMZ\n![IMAGE](quiver-image-url/DDE6C692DF2BD38D6A3A7782FAD2C7F8.jpg =1592x862)\n\nThis just partitions out your network so that your public access is limited to a subset of your internal network. You can also do this with two firewalls.\n\n## Load Balancers\nWhat you think. Do them in software. Provides elasticity on demand and availibility.\n\n## Intrusion Detection Devices\n\nTwo kinds:\n* Intrusion Detection System (IDS) Sensor\n* Intrusion Prevention System (IPS) Sensor\n\nThey can have a signature database to detect anomalous activity, like a syn-flood. Detection systems just get a copy of the traffic and detect the bad behavior, whereas prevention systems are between the world (your router) and your private network. Main thing - there are malicious behaviors that go beyond a port or protocol!\n\n## VPN Concentrators\n\nTODO\n\n## Appliances\n\nFancy firewalls -- **Next Generation Firewall (NGFW)**. This can help with, for example, encrypted malware. This would inspect TLS handshake protocol packets for, say, the cipher suite list, in order to compare against known attack vectors (just using data and statistics!). Similar statistics are used to examine packet sizes and content lengths, again to compare against a database of known malware attacks.\n\n**Content Filters** -- filter out objectionable content by inspecting traffic and filtering against a set of rules.\n\n**Unified Threat Management** -- multiple functions: firewalls, anti-malware, VPN concentrators, content filters, etc.\n\n## More Network Appliances\n\nSpecialized functionality!\n\n**Cache Engine** -- this is just an old-school CDN. Check for cache invalidation, otherwise serve requested resources from its own local storage / memory to save on routing and bandwidth.\n\n**Network-Attach Storage** (NAS) -- storage you access via a network. Ta-da. Read more on this + SANs.\n\n\n"
    }
  ]
}