{
  "title": "Chapter 3: Probabilistic Analysis and Randomized Quicksort",
  "cells": [
    {
      "type": "markdown",
      "data": "Quicksort works on pivots, where we can randomly choose our pivot point and bucket elements into `GREATER`, `EQUAL`, and `LESS`. Our worst-case by picking a constant pivot point of \"the left-most element\" is O(n^2). But if we randomize our pivot point selection, we can actually produce a `Worst-case Expected-Time Bound` of `O(n log n)` -- by randomizing our algoerithm, we actually gain more control over our expected runtimes. How?\n\nFor discrete distributions, we have a `sample space` containing `elementary events`. With rolling two dice, the sample space is the 36 different possible combinations of dice rolls, e.g. 36 elementary events `e` where each one has some nonzero probability `p(e)` of occuring. `Events` are just a subset of the sample space that are found by adding the probabilities of all elementary events constituting the event.\n\nWe can define a `random variable`, which is a function from elementary events to real numbers. For example, it allows us to do expectation values for things like \"two cards are equal\" or \"the sum of die is 7\". So `X(e)` for \"these two cards are equal\" might be 0 in all cases where they aren't equal, or `X(e)` might be just \"3\" given the elementary event of \"we rolled a 3\".\n\nThe `expectation value` of a random variable is such:\n![IMAGE](quiver-image-url/4C4613EDE055397D8CC8948979D69632.jpg =273x61)\nFor disjoint events `A_i`, it's:\n![IMAGE](quiver-image-url/1F2106202001E0B008AAF7CE5BD26457.jpg =489x71)\n\nLastly and importantly, these expectation values of random variables are **linear**. This just means: `E[X + Y] = E[X] + E[Y]`.\n\nWe can use these equations to define random variables, do some recurrence analysis, etc. and all of it will prove that the _worst-case expected-time bound_ of quicksort is indeed `O(n log n)`. Today is not the day I'm overly concerned with the details of those proofs, I'm not taking tests.\n\nGood things to reemember: what exactly are random variables, expectation values and their linearity, the fact that these tools let us calculate a worst-case expected-time bound on quicksort that's actually better than a non-randomized approach. Again - randomization provides tighter time bound expectations!\n\nIf I were studying this seriously, I'd do a lot of problems on defining random variables wel and constructing analyses from there."
    }
  ]
}