{
  "title": "Akamai",
  "cells": [
    {
      "type": "markdown",
      "data": "[An Introduction to the Akamai Content Delivery Network](https://medium.freecodecamp.org/an-introduction-to-the-akamai-content-delivery-network-806aa16d8781)\n* Akamai is a CDN meant to navigate the complexity of public internet routing, flaky networks, competing ISPS, etc.\n* They maintain a fleet of \"edge servers\". These serve as an overlay network to typical routing, and communicate with each other to bypass typical busy / troublesome routes.\n* Add Akamai by adding a CNAME record to your DNS linking your domain with some `edgekey.net` -- this CNAME indicates Akamai and will allow properties to be configured for what the edge server should do with traffic.\n* Akamai does route performance testing and caching too - the caching can be configured and is checked on each edge server hit when resolving a client request.\n* Typical cache keys are hostname, path, query string -- more can be added and conditionals work!\n\nAkamai's own website really emphasized the caching part! Makes sense.\n\n\"OCA Property\" in Akamai is NOT what we want for new Properties:\n\n1) Create New Property in PM\n2) Select \"Ion Standard\"\n3) Property Name == hostname (for Jet!)\n4) Select \"Enhanced TLS\" under \"Property Version Information\"\n5) Under \"Property Hostnames\" -> \"Add\"\n    * Hostname == property name etc\n    * IPv4 + IPv6\n    * Select default cert for your hostname domain (notjet, jet)\n    * Add Custom Edge Hostname with CNAME target == hostname + \".edgekey.net\" -- NO PERIOD AT END LIKE GUARDIANS-DNS repo CNAMEs.\n6) Add second \"Property Hostname\" for staging, with everything the same except the subdomain has \"-staging\" appended e.g. -> \"parcel-app-staging\"\n7) \"Content Provider Code\" -> Create New... (this runs out soon)\n8) Real User Monitoring - adds JavaScript to requests for tracking user data, defaulted to on for older Properties, but now we don't use it\n9) "
    }
  ]
}